var words = {
    start: [
        "木","石","火","土","金","水"
    ],
    rot: { //顺时针
        一: "1丨",
        丨: "1一",
        囗: "1囗",
    },
    comb: [ //0-空位
        //木林森
        "木木=林","木;林=森",
        //石砳磊柘
        "石石=砳","石;砳=磊","木石=柘",
        //火炎炏焱燚㷋炑焚棪炻
        "火;火=炎","火火=炏","火;炏=焱","火炎=㷋","火;焱=燚","火㷋=燚","炎炎=燚","炏;炏=燚","火木=炑","林;火=焚","木炎=棪","火石=炻",
        //土圭垚烓桂硅埮杜坧灶灻
        "土0;土土=垚","0土;土土=垚","土;土=圭","火圭=烓","木圭=桂","石圭=硅","土炎=埮","林;土=埜","木土=杜","土石=坧","火土=灶","土;火=灻",
        //金鍂鑫鈢鈥鉐碒釷銈錟
        "金金=鍂","金;鍂=鑫","金木=鈢","金火=鈥","金石=鉐","石金=碒","金土=釷","金圭=銈","金炎=錟",
        //水沝淼㵘㴇沐淋泵砅沰淡汢洼淦
        "水水=沝","水;沝=淼","沝;沝=㵘","水;淼=㵘","水沝=㴇","沝水=㴇","水木=沐","水林=淋","石;水=泵","石水=砅","水石=沰","水炎=淡","水土=汢","水圭=洼","水金=淦"
    ],
    level1:{
        start: [
            "草","句","禾","刀","囗","囗","玉","宀","豕","牛","一","一","一","一","一","夕","匕","以"
        ],
        score: 3000,
        comb: [
            //苟利国家生死以
            "草;句=苟","禾刀=利","囗玉=国","玉囗=国","囗;玉=国","玉;囗=国",
            "宀;豕=家","牛;一=生","一;夕=歹","歹匕=死","0一;夕匕=死",
            //草句禾刀囗 刕芀䒩囷菌豞苼
            "0刀;刀刀=刕","刀0;刀刀=刕","草;刀=芀","草;禾=䒩","囗禾=囷","禾囗=囷","囗;禾=囷","禾;囗=囷","草;囷=菌","豕句=豞","草;生=苼",
            //玉宀豕牛一丨 宝豩牢曰目田苗苜昫眗香圂豞牲犁牪犇眚甠
            "宀;玉=宝","豕豕=豩","宀;牛=牢","一;囗=曰","囗;一=曰","丨;曰=田","曰;丨=田","十;囗=田","一;曰=目","草;田=苗","草;目=苜","曰句=昫","目句=眗","禾;曰=香","豕囗=圂","囗豕=圂","豕;囗=圂","囗;豕=圂","豕句=豞","牛生=牲","利;牛=犁","牛牛=牪","牛;牪=犇","生;目=眚","曰生=甠",
            //十二三土圭干王 囯㝉坸玽秆珏琢牡旱刊旰幵芉玕盰晆茥珪眭
            "一;丨=十","丨;一=十","一;一=二","一;二=三","二;一=三","一;三=亖","二;二=亖","三;一=亖","丨;二=土","二;丨=干","一;土=王","干;一=王","三;丨=王","丨;三=王","一;十=干","十;一=土","土;土=圭","囗王=囯","王囗=囯","囗;王=囯","王;囗=囯","宀;一=㝉","土句=坸","王句=玽","禾干=秆","王玉=珏","王豕=琢","牛土=牡","王生=珄","曰;干=旱","干刀=刊","曰干=旰","干干=幵","草;干=芉","王干=玕","目干=盰","曰圭=晆","草;圭=茥","王圭=珪","目圭=眭",
            //夕 多够夠移芕茤夝宐
            "夕;夕=多","句多=够","多句=夠","禾多=移","草;夕=芕","草;多=茤","夕生=夝","宀;夕;一=宐",
            //比它苡秕切
            "匕匕=比","宀;匕=它","草;以=苡","禾比=秕","匕刀=切","土它=坨"
        ]
    },
    木: "lightgreen",
    草: "lightgreen",
    林: "#00DD77",
    森: "seagreen",
    石: "#dbdbdb",
    砳: "#b0b0b0",
    磊: "#a2a2a2",
    柘: "#c9a755",
    火: "#ffcbbf",
    炎: "#ff9780",
    炏: "#ff9780",
    焱: "#ff6340",
    㷋: "#ff6340",
    燚: "#ff2f00",
    炑: "#ffa14e",
    焚: "#ffba00",
    棪: "#ea8080",
    炻: "#9e4556",
    土: "#a89160",
    圭: "#efcd57",
    硅: "#6a6a6a",
    金: "#fcdb04",
    鍂: "#de9d01",
    鑫: "#b67b1d",
    水: "#bffff4",
    沝: "#80ffe8",
    淼: "#40ffdc",
    㴇: "#40ffdc",
    㵘: "#0bceaa",
    沐: "#81ffce",
    淡: "#f6fffd"
};
