var words = {
    start: [
        "木","石","火","土","金","水"
    ],
    rot: { //顺时针
        一: "2一",
        干: "2士",
        士: "2干",
    },
    comb: [ //0-空位
        //木林森
        "木木=林","木;林=森",
        //石砳磊柘
        "石石=砳","石;砳=磊","木石=柘",
        //火炎炏焱燚㷋炑焚棪炻
        "火;火=炎","火火=炏","火;炏=焱","火炎=㷋","火;焱=燚","火㷋=燚","炎炎=燚","炏;炏=燚","火木=炑","林;火=焚","木炎=棪","火石=炻",
        //土圭垚烓桂硅埮杜坧灶灻
        "土;土=圭","土0;土土=垚","0土;土土=垚","火圭=烓","木圭=桂","石圭=硅","土炎=埮","林;土=埜","木土=杜","土石=坧","火土=灶","土;火=灻",
        //金鍂鑫鈢鈥鉐碒釷銈錟
        "金金=鍂","金;鍂=鑫","金木=鈢","金火=鈥","金石=鉐","石金=碒","金土=釷","金圭=銈","金炎=錟",
        //水沝淼㵘㴇沐淋泵砅沰淡汢洼淦
        "水水=沝","水;沝=淼","沝;沝=㵘","水;淼=㵘","水沝=㴇","沝水=㴇","水木=沐","水林=淋","石;水=泵","石水=砅","水石=沰","水炎=淡","水土=汢","水圭=洼","水金=淦"
    ],
    木: "lightgreen",
    林: "#00DD77",
    森: "seagreen",
    石: "#dbdbdb",
    砳: "#b0b0b0",
    磊: "#a2a2a2",
    柘: "#c9a755",
    火: "#ffcbbf",
    炎: "#ff9780",
    炏: "#ff9780",
    焱: "#ff6340",
    㷋: "#ff6340",
    燚: "#ff2f00",
    炑: "#ffa14e",
    焚: "#ffba00",
    棪: "#ea8080",
    炻: "#9e4556",
    土: "#a89160",
    圭: "#efcd57",
    硅: "#6a6a6a",
    金: "#fcdb04",
    鍂: "#de9d01",
    鑫: "#b67b1d",
    水: "#bffff4",
    沝: "#80ffe8",
    淼: "#40ffdc",
    㴇: "#40ffdc",
    㵘: "#0bceaa",
    沐: "#81ffce",
    淡: "#f6fffd"
};
